export const db = [
  {
    id: '1',
    title: 'example1',
    img: 'Данные будут подтягиваться с бека(изображение сохраненного решения)',
    code: 'console.log("123")',
  },
  {
    id: '2',
    title: 'simple task',
    img: 'Данные будут подтягиваться с бека(изображение сохраненного решения)',
    code: 'console.log("222")',
  },
  {
    id: '3',
    title: 'hard task',
    img: 'Данные будут подтягиваться с бека(изображение сохраненного решения)',
    code: 'console.log("333")',
  },
  {
    id: '4',
    title: 'task',
    img: 'Данные будут подтягиваться с бека(изображение сохраненного решения)',
    code: 'console.log("444")',
  },
  {
    id: '5',
    title: 'simple task on javascript',
    img: 'Данные будут подтягиваться с бека(изображение сохраненного решения)',
    code: 'console.log("555")',
  },
  {
    id: '6',
    title: 'task123',
    img: 'Данные будут подтягиваться с бека(изображение сохраненного решения)',
    code: 'console.log("666")',
  },
];
