const ruLocales = {
  translation: {
    about: {
      pageHeader: 'Информация о проекте',
      projectName: 'Run IT',
      projectDescription: ` — среда для написания и исполнения кода, которую будем активно использовать на всех платформах Хекслета.`,
      analogueIs: 'Ближайший аналог — сервис',
      analogueName: 'repl.it',
      backendIsOn: 'Бэкенд разрабатывается на',
      firstBackendDevTool: 'NestJS',
      and: 'и',
      secondBackendDevTool: 'TypeScript',
      frontendIsOn: ', на фронтенде используется',
      frontendDevTool: 'React',
      footer: {
        hexlet: '© ООО “Хекслет Рус”',
        about: 'О проекте',
        code: 'Исходный код',
        linkToSlack: 'Slack #hexlet-volunteers',
        help: 'Помощь',
        knowledgeBase: 'База знаний',
        linkToHexletGuides: 'Hexlet Guides',
        more: 'Дополнительно',
        linkToCodeBasics: 'Code Basics',
        linkToCodeBattles: 'Code Battles',
      },
    },
    signUp: {
      pageHeader: 'Регистрация',
      emailLabel: 'Электронная почта',
      usernameLabel: 'Логин',
      passwordLabel: 'Пароль',
      confirmPasswordLabel: 'Подтвердить пароль',
      registerButton: 'Зарегистрироваться',
      signUpFailed: 'Такой пользователь уже существует',
      footer: {
        signInHeader: 'Уже есть аккаунт? ',
        signIn: 'Войти',
      },
      validation: {
        requiredField: 'Обязательное поле',
        correctUsername: 'Только буквы латинского алфавита в любом регистре',
        correctEmail: 'Некорректная электронная почта',
        usernameLength: 'От 3 до 20 символов',
        passwordLength: 'от 8 до 30 символов',
        confirmPassword: 'Пароли должны совпадать',
      },
    },
    remindPass: {
      pageHeader: 'Забыли пароль?',
      emailLabel: 'Электронная почта',
      resetButton: 'Восстановить пароль',
      footer: {
        signUpHeader: 'Нет аккаунта? ',
        signUp: 'Создать бесплатный аккаунт',
        signInHeader: 'Уже есть аккаунт? ',
        signIn: 'Войти',
      },
      validation: {
        correctEmail: 'Некорректный email',
      },
    },
    signIn: {
      pageHeader: 'Вход',
      emailLabel: 'Электронная почта',
      passwordLabel: 'Пароль',
      loginButton: 'Войти',
      remindPass: 'Не помню пароль',
      signInFailed: 'Неверный пароль или электронная почта',
      footer: {
        signUpHeader: 'Нет аккаунта? ',
        signUp: 'Создать бесплатный аккаунт',
      },
    },
    profile: {
      replsHeader: 'Сниппеты',
      username: 'Имя пользователя:',
      createdAt: 'Создан:',
      userId: 'Идентификатор пользователя:',
      email: 'Эл. почта:',
      editProfileButton: 'Редактировать',
      copyProfileButton: 'Скопировать ссылку',
      openReplButton: 'Открыть',
      shareReplButton: 'Поделиться',
      renameReplButton: 'Переименовать',
      deleteReplButton: 'Удалить',
      newReplButton: 'Новый сниппет',
    },
    navbar: {
      mainLabel: 'Run IT',
      menu: 'Меню',
      home: 'Домой',
      myRepls: 'Мои сниппеты',
      profile: 'Профиль',
      about: 'О проекте',
      logout: 'Выйти',
      signIn: 'Войти',
      signUp: 'Зарегистрироваться',
    },
    footer: {
      hexlet: 'Хекслет',
      about: 'О нас',
      career: 'Карьера в Хекслете',
      shop: 'Магазин мерча',
      doc: 'Документы',
      conditions: 'Условия использования',
      agreement: 'Соглашение об обработке ПД',
      offer: 'Публичная оферта',
      licenseAgreement:
        'Лицензионное соглашение для некоммерческого использования',
      promo: 'Акции',
      tel1: '8 800 100 22 47',
      tel1Href: 'tel:88001002247',
      rf: ' бесплатно по РФ',
      tel2: '+7 495 085 28 38',
      tel2Href: 'tel:84950852838',
      moscow: ' бесплатно по Москве',
      name: 'ООО «Хекслет Рус»',
      city: '432071, г. Ульяновск,',
      street: 'пр-т Нариманова, дом 1Г, оф. 23',
      ogrn: 'ОГРН 1217300010476',
      study: 'Учиться',
      programs: 'Профессии с нуля',
      courses: 'Все курсы',
      individually: 'Индивидуальное обучение',
      teams: 'Корпоративное обучение',
      read: 'Читать',
      success: 'Истории успеха',
      feedback: 'Отзывы студентов',
      blog: 'Блог',
      questions: 'Вопросы по урокам',
      recommended: 'Рекомендуемые книги',
      subscribe: 'Подписаться',
      help: 'Помощь',
      info: 'Справка',
      qna: 'Вопросы и ответы',
      mail: 'support@hexlet.io',
      mailHref: 'mailto:support@hexlet.io',
      improve: 'Улучшить Хекслет',
      project: 'Наши проекты',
      college: 'Хекслет Колледж',
      codeBasics: 'Code Basics',
      codeBattle: 'Codebattle',
      guides: 'Hexlet Guides',
      cv: 'Хекслет-резюме',
      language: 'Язык',
      en: 'English',
      ru: 'Русский',
    },
    embedFrame: {
      runButton: 'Запустить',
      logoOffer: 'Попробуйте на',
      logo: 'Run IT',
    },
    editor: {
      authBanner: 'Авторизуйтесь для редактирования',
      runButton: 'Запустить',
      shareButton: 'Поделиться',
      unsavedChanges: 'В коде есть несохраненные изменения',
      allSaved: 'Несохраненных изменений нет',
    },
    modals: {
      share: {
        header: 'Сохраните, чтобы поделиться.',
        copyLinkButton: 'Скопировать ссылку',
        linkTab: 'Ссылка',
        copyEmbedButton: 'Скопировать код',
        embedTab: 'Код для вставки',
        saveSnippetButton: 'Сохранить',
        saveSnippetTab: 'Сохранить сниппет',
        snippetNameLabel: 'Введите имя',
        snippetLinkLabel: 'Ссылка на сниппет',
        snippetEmbedLabel: 'Код сниппета для вставки',
      },
      confirmation: {
        header: 'Вы точно хотите удалить сниппет?',
        confirmButton: 'Удалить',
        cancelButton: 'Отмена',
      },
      changePassword: {
        header: 'Сменить пароль',
        currentPassword: 'Текущий пароль',
        newPassword: 'Новый пароль',
        confirmNewPassword: 'Подтвердите новый пароль',
        wrongPassword: 'Неверный пароль',
      },
      newSnippetName: 'Название сниппета',
      signInButton: 'Войти',
      signUpButton: 'Создать аккаунт',
      signInHeader: 'Авторизация',
      signUpHeader: 'Регистрация',
      editUserHeader: 'Редактирование',
      sendButton: 'Отправить',
      infoBody: 'Авторизуйтесь, чтобы сохранять и делиться.',
      cancelButton: 'Отмена',
      goToReplButton: 'Перейти к этому реплу',
      validation: {
        snippetNameMaxLength: 'Не больше 20 символов',
        required: 'Не может быть пустым',
        singleWord: 'Допустимы буквы латинского алфавита, цифры и символы "-_"',
      },
    },
    appRotes: {
      pageNotFound: 'Страница не найдена',
    },
    errors: {
      unknown: 'Неизвестная ошибка',
      network: 'Ошибка сети',
    },
    pageNotFound: {
      oops: 'Упс!',
      notFound: 'Страница не найдена.',
      noExist: 'Страница, которую вы ищете, не существует.',
      returnButton: 'Вернуться на главную',
    },
    faq: {
      faq: 'FAQ',
      q0: 'Что такое IDE?',
      a0: 'Интегрированная среда разработки (IDE) — это программное приложение, которое позволяет разработчикам писать, отлаживать и тестировать код, используя при этом один из нескольких языков программирования. Интегрированные среды разработки популярны среди разработчиков, потому что они ускоряют и упрощают работу по написанию кода. Так же как писатели используют текстовые редакторы, а бухгалтеры – электронные таблицы, разработчики программного обеспечения применяют IDE, чтобы повысить продуктивность.',
      q1: 'Как инструменты IDE помогают разработчикам?',
      a11: 'Большинство IDE включают в себя функции, выходящие за рамки обычного редактора кода. В одном приложении объединено множество различных инструментов, благодаря которым разработчики могут быстро приступить к программированию новых приложений вместо того, чтобы вручную интегрировать и настраивать различное ПО. Вот несколько важных функций IDE.',
      a12: 'Автоматизация редактирования кода',
      a13: ' • IDE знает правила структурирования утверждений в языках программирования и автоматически редактирует исходный код',
      a14: 'Выделение синтаксиса',
      a15: ' • IDE определяет язык, на котором пишут код, и выделяет разным цветом функции, переменные и операторы. Это помогает быстро визуально считывать синтаксис',
      a16: 'Автозаполнение',
      a17: ' • IDE может предложить продолжить строку на основе первых введённых символов. Это позволяет быстрее вводить названия функций и библиотек, не ошибаться в синтаксисе',
      a18: 'Поддержка рефакторинга',
      a19: ' • IDE могут использовать авторефакторинг с целью сделать исходный код более эффективным и читаемым без изменения его основной функциональности',
      a110: 'Автоматизация локальной сборки',
      a111: ' • IDE повышают производительность труда программистов, выполняя повторяющиеся задачи разработки, которые обычно являются частью каждого изменения кода',
      a112: 'Компиляция',
      a113: ' • IDE компилирует или преобразует код, написанный разработчиком, в язык, понятный операционной системе',
      a114: 'Тестирование',
      a115: ' • IDE позволяет разработчикам автоматизировать модульные тесты локально, прежде чем программное обеспечение будет интегрировано с кодом других разработчиков и будут запущены более сложные интеграционные тесты',
      a116: 'Отладка',
      a117: ' • Помогает устранить ошибки в коде и подсказывает, как их исправить.',
      q2: 'Какие бывают IDE?',
      a2: 'Интегрированные среды разработки (IDE) можно разделить на несколько различных категорий в зависимости от того, какую разработку приложений они поддерживают и как работают.',
      a21: 'Облачные IDE',
      a22: ' • Используются для написания, редактирования и компиляции кода непосредственно в браузере, что избавляет их от необходимости загружать программное обеспечение на локальные машины. Облачные IDE имеют стандартизированную среду разработки, могут работать с любой машины и используют вычислительные ресурсы из облака, что освобождает ресурсы локальной машины',
      a23: 'Локальные IDE',
      a24: ' • Устанавливаются и запускаются непосредственно на локальных машинах. Требуют загрузки и установки дополнительных библиотек в зависимости от требований проекта и языка разработки. Установка локальных IDE может отнимать много времени и быть сложной, а различия в конфигурации между локальной машиной и производственной средой — привести к ошибкам в программном обеспечении.',
      q3: 'В чем особенность IDE Run IT?',
      a3: 'Run IT – это облачная интегрированная среда разработки (IDE), в которой можно создавать и запускать код на языке JavaScript, а также выполнять его отладку напрямую в браузере. Run IT можно запустить на любом устройстве, с любой операционной системой.',
      a31: 'В перспективе расширение набора функций: поддержка других популярных языков программирования, совместная работа с другими участниками, а также готовые шаблоны с кодом для более удобной и быстрой работы.',
    },
    licAgr: {
      h2_1: 'Условия лицензии «Commons Clause» v1.0',
      city: 'город Ульяновск',
      date: 'Дата публикации: 13.12.2022',
      p1: 'Программное обеспечение предоставляется вам Лицензиаром по Лицензии, как определено ниже, при соблюдении следующих условий. Без ограничения других условий Лицензии предоставление прав по Лицензии не будет включать, и Лицензия не предоставляет вам право Продавать Программное обеспечение. Для целей вышеизложенного «Продать» означает осуществление каких-либо или всех прав, предоставленных вам в соответствии с Лицензией, для предоставления третьим сторонам за вознаграждение или иное вознаграждение (включая, помимо прочего, плату за хостинг или консультационные/поддерживающие услуги, связанные с Программное обеспечение), продукт или услуга, ценность которых полностью или в значительной степени определяется функциональностью Программного обеспечения.',
      p2: 'Любое уведомление о лицензии или указание авторства, требуемое Лицензией, должно также включать это уведомление об Условиях лицензии в соответствии с общими положениями.',
      h2_2: 'Генеральная публичная лицензия GNU Affero, Редакция 3, 19 ноября 2007 г.',
      p3: 'Copyright (C) 2007 Free Software Foundation, Inc. http://fsf.org/.',
      h31: 'Введение',
      p4_1: `Генеральная публичная лицензия GNU Affero (Affero GPL, AGPL) -- свободная
      лицензия для программного обеспечения и произведений других видов, разрешающая
      свободное создание производных произведений, используемых на условиях GNU AGPL,
      предназначенная для обеспечения сотрудничества с сообществом разработчиков
      программного обеспечения, работающего на сетевых серверах.
      Лицензии на большинство программ и других прикладных работ составлены так, чтобы
      лишить Вас права распространять и изменять такие произведения. В
      противоположность этому, Генеральные публичные лицензии GNU предназначены для
      того, чтобы предоставить Вам право распространять и изменять все версии
      программы, чтобы она оставалась свободным программным обеспечением для всех
      пользователей.`,
      p4_2: `Когда мы говорим о свободном программном обеспечении, мы имеем в виду свободу
      использования, а не бесплатность. Наши Генеральные публичные лицензии составлены
      для того, чтобы убедиться, что у Вас есть право распространять копии свободного
      ПО (и взимать плату за них, если Вы хотите), что Вы получаете исходные тексты
      или можете получить их, если захотите, что Вы можете изменять программное
      обеспечение или использовать его части в новых свободных программах, и что Вы
      знаете о своем праве делать все это.`,
      p4_3: `Разработчики, использующие наши Генеральные публичные лицензии, гарантируют Ваши
      права при помощи следующих мер:`,
      p4_4: `1) закрепляют авторское право на программное обеспечение, и (2) предлагают Вам
      принять условия настоящей Лицензии, закрепляющей Ваше право на создание копий,
      распространение и (или) модификацию программного обеспечения.`,
      p4_5: `Еще одно преимущество защиты свободы всех пользователей заключается в том, что
      улучшения, сделанные в разных версиях программы, при их широком распространении
      становятся доступными для использования другими разработчиками. Многие
      разработчики программного обеспечения воодушевляются этим сотрудничеством и
      пользуются его преимуществами. Однако если речь идет о программах, работающих на
      сетевых серверах, такого результата можно не достичь. Генеральная публичная
      лицензия GNU разрешает создание измененных версий и предоставление
      неограниченного доступа к ним, не делая общедоступным их исходного текста.
      Генеральная публичная лицензия GNU Affero предназначена для того, чтобы
      обеспечить в таких ситуациях общедоступность измененного исходного текста. Она
      налагает на владельца сетевого сервера обязанность предоставить исходный текст
      измененной версии программы пользователям этого сервера. Таким образом,
      использование измененной версии на общедоступном сервере влечет за собой
      предоставление общего доступа к исходному тексту такой измененной версии.
      Предыдущая лицензия, которая называлась "Генеральной публичной лицензией Affero"
      и была опубликована компанией Affero, была разработана для достижения тех же
      целей. Настоящая Лицензия не является версией Affero GPL; компания Affero
      опубликовала новую редакцию Affero GPL, которая позволяет повторный выпуск
      произведения на условиях настоящей Лицензии.`,
      p5: `Детальные определения используемых терминов и описание условий копирования,
распространения и внесения изменений приведены ниже.`,
      h2_3: 'ТЕРМИНЫ И УСЛОВИЯ',
      h32: '0. Определения',
      p6: `"Настоящая Лицензия" -- версия 3 Генеральной публичной лицензии GNU Affero.
      Под "Авторским правом" также понимаются законы, сходные с авторско-правовыми,
      которые применяются к другим видам работ, например, к топологиям микросхем.
      Термином "Программа" обозначается любое охраноспособное произведение,
      используемое в соответствии с настоящей Лицензией. Лицензиат именуется "Вы".
      "Лицензиаты" и "получатели" могут быть как физическими лицами, так и
      организациями.`,
      p7: `"Внесение изменений" в произведение означает копирование или адаптацию
      произведения целиком или в части, способом, требующим разрешения
      правообладателя, за исключением изготовления его точной копии. Получившееся
      произведение называется "измененной версией" предыдущего произведения или
      произведением, "основанным на" более ранней работе.`,
      p8_1: `Термином "Лицензионное произведение" обозначается неизмененная Программа или
      произведение, основанное на Программе.`,
      p8_2: `"Распространение" произведения означает совершение с ним действий, которые при
      отсутствии разрешения сделают Вас прямо или косвенно ответственным за нарушение
      действующего закона об авторском праве, за исключением запуска на компьютере или
      изменения копии, созданной в личных целях. Распространение включает в себя
      копирование, раздачу копий (с изменениями или без них), доведение до всеобщего
      сведения, а в некоторых странах -- и другие действия.`,
      p9: `"Передача" произведения означает любой вид распространения, который позволяет
      другим лицам создавать или получать копии произведения. Обычное взаимодействие с
      пользователем через компьютерную сеть без создания копии передачей не является.
      В диалоговом режиме пользователю должна быть показана "Информация об авторском
      праве", достаточная для того, чтобы (1) обеспечить отображение соответствующего
      уведомления об авторских правах и (2) сообщить пользователю о том, что ему не
      предоставляется никакой гарантии на произведение (за исключением фактически
      предоставленных гарантий), о том, что лицензиаты могут передавать произведение
      на условиях, описанных в настоящей Лицензии, а также о том, как ознакомиться с
      текстом настоящей Лицензии. Если интерфейс предоставляет собой список
      пользовательских команд или настроек, наподобие меню, это требование считается
      выполненным при наличии явно выделенного пункта в таком меню.`,
      h33: '1. Исходный текст',
      p10_1: `Под "Исходным текстом" понимается произведение в форме, которая более всего
      подходит для внесения в него изменений.`,
      p10_2: `"Объектным кодом" называется произведение в любой иной форме.`,
      p10_3: `"Стандартный интерфейс" -- интерфейс, который либо является общепринятым
      стандартом, введенным общепризнанным органом по стандартизации, либо, в случае
      интерфейсов, характерных для конкретного языка программирования -- тот, который
      широко используется разработчиками, пишущими программы на этом языке.
      "Системные библиотеки" исполняемого произведения включают в себя то, что не
      относится к произведению в целом и при этом (a) входит в обычный комплект 
      основного компонента, но при этом не является его частью и (b) служит только для
      обеспечения работы с этим Основным компонентом или реализации Стандартного
      интерфейса, для которого существует общедоступная реализация, опубликованная в
      виде исходного текста. "Основным компонентом" в данном контексте назван главный
      существенный компонент (ядро, оконная система и т.д.) определенной операционной
      системы (если она используется), под управлением которой функционирует
      исполняемое произведение, либо компилятор, используемый для создания
      произведения или интерпретатор объектного кода, используемый для его запуска.
      "Полный исходный текст" для произведения в форме объектного кода -- весь
      исходный текст, необходимый для создания, установки и (для исполняемого
      произведения) функционирования объектного кода, а также модификации
      произведения, включая сценарии, контролирующие эти действия. Однако он не
      включает в себя Системные библиотеки, необходимые для функционирования
      произведения, инструменты общего назначения или общедоступные свободные
      программы, которые используются в неизменном виде для выполнения этих действий,
      но не являются частью произведения. Полный исходный текст включает в себя,
      например, файлы описания интерфейса, прилагаемые к файлам исходного текста
      произведения, а также исходные тексты общих библиотек и динамически связанных
      подпрограмм, которые требуются для функционирования произведения и разработаны
      специально для этого, например для прямой передачи данных или управления
      потоками между этими подпрограммами и другими частями произведения.`,
      p10_4: `Полный исходный текст не включает в себя то, что пользователи могут
      сгенерировать автоматически из других частей Полного исходного текста.
      Полным исходным текстом для произведения в форме исходных текстов является само
      это произведение.`,
      h34: `2. Основные права`,
      p11: `Все права, предоставленные на основании настоящей Лицензии, действуют в течение
      срок действия авторских прав на Программу и не могут быть отозваны при условии,
      что сформулированные в ней условия соблюдены. Настоящая Лицензия однозначно
      подтверждает Ваши неограниченные права на запуск неизмененной Программы.
      Результаты функционирования Лицензионного произведения распространяются на
      условиях настоящей Лицензии в том случае, если они, учитывая их содержание,
      являются частью Лицензионного произведения. Настоящая Лицензия подтверждает Ваши
      права на свободное использование произведения или другие аналогичные полномочия,
      предусмотренные действующим законодательством об авторском праве.`,
      p12: `Если Вы не осуществляете обычную передачу Лицензионного произведения, то можете
      как угодно создавать, запускать и распространять его копии до тех пор, пока
      Лицензия сохраняет силу. Вы можете передавать Лицензионные произведения третьим
      лицам исключительно для того, чтобы они внесли в них изменения для Вас или
      предоставили Вам возможность их запуска, при условии, что Вы соглашаетесь с
      условиями настоящей Лицензии при передаче всех материалов, авторскими правами на
      которые Вы не обладаете. Лица, создающие или запускающие Лицензионные
      произведения для Вас, должны делать это исключительно от Вашего имени, под Вашим
      руководством и контролем, на условиях, которые запрещают им создание без Вашей
      санкции каких-либо копий материалов, на которые Вы обладаете авторским правом.
      Любая другая передача разрешается исключительно при соблюдении описанных ниже
      условий. Сублицензирование не допускается; раздел 10 делает его не нужным.`,
      h35: '3. Защита прав пользователей от законов, запрещающих обход технических средств',
      p13: `Ни одно Лицензионное произведение не должно считаться содержащим эффективные
      технические средства, удовлетворяющие требованиям любого действующего закона,
      принятого для исполнения обязательств, предусмотренных статьей 11 Договора ВОИС
      по авторскому праву от 20 декабря 1996 года или аналогичных законов, запрещающих
      или ограничивающих обход таких технических средств.`,
      p14: `При передаче Лицензионного произведения Вы отказываетесь от всех предоставляемых
      законом полномочий по запрету обхода технических средств, используемых авторами    
      в связи с осуществлением их прав, признавая, что такой обход находится в рамках
      осуществления прав на использование Лицензионного произведения, предоставленных
      настоящей Лицензией; также Вы отказываетесь от любых попыток ограничить
      функционирование произведения или внесение в него изменений, направленных на
      реализацию предоставленных Вам законом прав на запрет пользователю обхода
      технических средств.`,
      h36: '4. Передача не измененных копий',
      p15: `Вы можете передавать точные копии исходных текстов Программы в том виде, в
      котором Вы их получили, на любом носителе, при условии, что Вы прилагаете к
      каждой копии соответствующее уведомление об авторских правах способом,
      обеспечивающим ознакомление с ним пользователя; сохраняете все уведомления о
      том, что к тексту применима настоящая Лицензия и любые ограничения, добавленные
      в соответствии с разделом 7; сохраняете все уведомления об отсутствии каких-либо
      гарантий; предоставляете всем получателям вместе с Программой копию настоящей
      Лицензии.`,
      p16: `Вы можете установить любую цену за каждую копию, которую Вы передаете, или
      распространять копии бесплатно; также Вы можете предложить поддержку или
      гарантию за отдельную плату.`,
      h37: '5. Передача измененных исходных текстов',
      p17: `Вы можете передавать исходный текст произведения, основанного на Программе, или
      изменений, необходимых для того, чтобы получить его из Программы, на условиях,
      описанных в разделе 4, при соблюдении следующих условий:
      а) Произведение должно содержать уведомления о произведенных Вами изменениях с
      указанием их даты, сделанные способом, обеспечивающим ознакомление с ними
      пользователя.`,
      p18: `b) Произведение должно содержать уведомление о том, что оно распространяется на
      условиях настоящей Лицензии, а также об условиях, добавленных в соответствии с
      разделом 7, сделанное способом, обеспечивающим ознакомление с ним пользователя.
      Данное требование имеет приоритет над требованиями раздела 4 "оставлять
      нетронутыми все уведомления".`,
      p19: `c) Вы должны передать на условиях настоящей Лицензии всю работу целиком любому
      лицу, которое приобретает копию.`,
      p20_1: `Таким образом, настоящая Лицензия вместе с любыми применимыми условиями раздела
      7 будет применяться к произведению в целом и всем его частям, независимо от их
      комплектности.`,
      p20_2: `Настоящая Лицензия не дает права на лицензирование произведения на любых других
      условиях, но это не лишает законной силы такое разрешение, если Вы получили его
      отдельно.`,
      p21: `d) Если произведение имеет интерактивные пользовательские интерфейсы, каждый из
      них должен отображать Информацию об авторском праве; однако, если Программа
      имеет пользовательские интерфейсы, которые не отображают информацию об авторском
      праве, от Вашего произведения этого также не требуется.`,
      p22: `Включение Лицензионного произведения в подборку на разделе хранения данных или
      на носителе, на котором распространяется произведение, вместе с другими
      отдельными самостоятельными произведениями, которые по своей природе не являются
      переработкой Лицензионного произведения и не объединены с ним, например, в
      программный комплекс, называется "набором", если авторские права на подборку не
      используются для ограничения доступа к ней или законных прав ее пользователей
      сверх того, что предусматривают лицензии на отдельные произведения. Включение
      Лицензионного произведения в набор не влечет применения положений настоящей
      Лицензии к остальным его частям.`,
      h38: '6. Передача произведения в формах, не относящихся к исходному тексту',
      p23: `Вы можете передавать Лицензионное произведение в виде объектного кода в
      соответствии с положениями разделов 4 и 5, при условии, что Вы также передаете
      машиночитаемый Полный исходный текст в соответствии с условиями настоящей
      Лицензии, одним из следующих способов:`,
      p24: `а) Передавая объектный код или содержащий его материальный продукт (включая
      распределенный материальный носитель), с приложением Полного исходного текста на
      материальном носителе, обычно используемом для обмена программным обеспечением.`,
      p25: `b) Передавая объектный код или содержащий его материальный продукт (включая
      носитель, на котором распространяется произведение), с письменным предложением,
      действительным в течение не менее трех лет либо до тех пор, пока Вы
      предоставляете запасные части или поддержку для данного продукта, о передаче
      любому обладателю объектного кода (1) копии Полного исходного текста для всего
      программного обеспечения, содержащегося в продукте, на которое распространяется
      действие настоящей Лицензии, на физическом носителе, обычно используемом для
      обмена программным обеспечением, по цене, не превышающей разумных затрат на
      передачу копии, или (2) доступа к Полному исходному тексту с возможностью его
      копирования с сетевого сервера без взимания платы.`,
      p26: `с) Передавая отдельные копии объектного кода с письменной копией предложения о
      предоставлении Полного исходного текста. Этот вариант допускается только в
      отдельных случаях при распространении без извлечения прибыли, и только если Вы
      получили объектный код с таким предложением в соответствии с пунктом 6b.`,
      p27: `d) Передавая объектный код посредством предоставления доступа к нему по
      определенному адресу (бесплатно или за дополнительную плату), и предлагая
      эквивалентный доступ к Полному исходному тексту таким же способом по тому же
      адресу без какой-либо дополнительной оплаты. От Вас не требуется принуждать
      получателей копировать Полный исходный текст вместе с объектным кодом. Если
      объектный код размещен на сетевом сервере, Полный исходный текст может
      находиться на другом сервере (управляемом Вами или третьим лицом), который
      предоставляет аналогичную возможность копирования; при этом Вы должны четко
      указать рядом с объектным кодом способ получения Полного исходного текста.
      Независимо от того, на каком сервере расположен Полный исходный текст, Вы
      обязаны убедиться в том, что он будет распространяться в течение времени,
      необходимого для соблюдения этих требований.`,
      p28: `e) Передавая объектный код с использованием одноранговой (пиринговой) сети, при
      условии информирования других пользователей сети о том, где можно бесплатно
      получить объектный код и Полный исходный текст произведения способом, описанным
      в пункте 6d.`,
      p29_1: `Не нужно включать в передаваемый объектный код его отделимые части, исходные
      тексты которых не входят в состав Полного исходного текста, такие как Системные
      библиотеки.`,
      p29_2: `"Потребительский товар" это либо (1) "товар, предназначенный для личных нужд",
      под которым понимается любое материальное личное имущество, которое обычно
      используется для личных, семейных или домашних целей, или (2) что-либо
      спроектированное или продающееся для использования в жилище. При определении
      того, предназначен ли товар для личных нужд, сомнения должны толковаться в
      пользу положительного ответа на этот вопрос. Применительно к конкретному товару,
      используемому конкретным пользователем, под выражением "обычно используется"
      имеется в виду способ, которым данный вид товаров преимущественно или как
      правило используется, независимо от статуса конкретного пользователя или
      способа, которым конкретный пользователь использует, предполагает или будет
      использовать товар. Товар относится к предназначенным для личных нужд независимо
      от того, насколько часто он используется в коммерческой деятельности,
      промышленности или иной сфере, не относящейся к личным нуждам, за исключением
      случая, когда использование в этой сфере представляет собой единственный
      основной способ использования такого товара.`,
      p29_3: `"Информация, необходимая для установки" Потребительского товара -- любые методы,
      процедуры, сведения, необходимые для авторизации, или другая информация,
      необходимая для установки и запуска в Потребительском товаре измененных версий
      Лицензионного произведения, полученных при изменении Полного исходного текста.
      Данная информация должна быть достаточной для того, чтобы обеспечить возможность
      внесения в исходный текст изменений, не приводящих к ограничению или нарушению
      его дальнейшей работоспособности.`,
      p29_4: `Если вместе с Потребительским товаром или специально для использования в нем Вы
      передаете произведение в виде объектного кода на условиях, описанных в данном
      разделе, и такая передача является частью сделки, по которой право владения и
      пользования Потребительским товаром переходит к получателю пожизненно или на
      определенный срок (независимо от признаков сделки), Полный исходный текст,
      передаваемый согласно данному разделу, должен сопровождаться Информацией,
      необходимой для установки. Но это требование не применяется, если ни Вы, ни
      какое-либо третье лицо не сохраняет за собой возможности установки измененного
      объектного кода на Потребительский товар (например, произведение было
      установлено в постоянную память).`,
      p30: `Требование о предоставлении Информации, необходимой для установки, не включает в
      себя требование продолжения оказания услуг по поддержке, предоставления гарантии
      или обновлений для произведения, которое было изменено или установлено
      получателем, либо для Потребительского товара, в котором оно было изменено или
      на который оно было установлено. В доступе к сети может быть отказано, если само
      внесение изменений существенно и негативно влияет на работу сети, нарушает
      правила обмена данными или не поддерживает протоколы для обмена данными по сети.
      Передаваемый в соответствии с данным разделом Полный исходный текст и
      предоставленная Информация, необходимая для установки, должны быть записаны в
      формате, который имеет общедоступное описание (и общедоступную реализацию,
      опубликованную в форме исходного текста) и не должны требовать никаких
      специальных паролей или ключей для распаковки, чтения или копирования.`,
      h39: '7. Дополнительные условия',
      p31: `"Дополнительными разрешениями" называются условия, которые дополняют условия
      настоящей Лицензии, делая исключения из одного или нескольких ее положений.
      Дополнительные разрешения, которые применимы ко всей Программе, должны
      рассматриваться как часть настоящей Лицензии, в той степени, в которой они
      соответствуют действующему законодательству. Если дополнительные разрешения
      применяются только к части Программы, эта часть может быть использована отдельно
      на измененных условиях, но вся Программа продолжает использоваться на условиях
      настоящей Лицензии без учета дополнительных разрешений.`,
      p32_1: `Когда Вы передаете копию Лицензионного произведения, Вы можете по своему
      усмотрению исключить любые дополнительные разрешения, примененные к этой копии
      или к любой ее части. (Для дополнительных разрешений может быть заявлено
      требование об их удалении в определенных случаях, когда Вы вносите изменения в
      произведение.) Вы можете добавлять дополнительные разрешения к добавленным Вами
      в Лицензионное произведение материалам, на которые Вы обладаете авторскими
      правами или правом выдачи соответствующего разрешения.`,
      p32_2: `Независимо от любых других положений настоящей Лицензии, Вы можете дополнить
      следующими условиями положения настоящей Лицензии в отношении материала,
      добавленного к Лицензионному произведению (если это разрешено обладателями
      авторских прав на материал):`,
      p33: `a) отказом от гарантий или ограничением ответственности, отличающимися от тех,
      что описаны в разделах 15 и 16 настоящей Лицензии; либо`,
      p34: `b) требованием сохранения соответствующей информации о правах или об авторстве
      материала, или включения ее в Информацию об авторском праве, отображаемую
      содержащим его произведением; либо`,
      p35: `c) запретом на искажение информации об источнике происхождения материала или
      требованием того, чтобы измененные версии такого материала содержали корректную
      отметку об отличиях от исходной версии; либо`,
      p36: `d) ограничением использования в целях рекламы имен лицензиаров или авторов
      материала; либо`,
      p37: `e) отказом от предоставления прав на использование в качестве товарных знаков
      некоторых торговых наименований, товарных знаков или знаков обслуживания; либо`,
      p38: `f) требованием от каждого, кто по договору передает материал (или его измененные
      версии), предоставления компенсации лицензиарам и авторам материала в виде
      принятия на себя любой ответственности, которую этот договор налагает на
      лицензиаров и авторов.`,
      p39: `Все остальные ограничительные дополнительные условия считаются "дополнительными
      запретами" по смыслу раздела 10. Если программа, которую Вы получили, или любая
      ее часть содержит уведомление о том, что наряду с настоящей Лицензией ее
      использование регулируется условием, относящимся к дополнительным запретам, Вы
      можете удалить такое условие. Если лицензия содержит дополнительный запрет, но
      допускает лицензирование на измененных условиях или передачу в соответствии с
      настоящей Лицензией, Вы можете добавить к Лицензионному произведению материал,
      используемый на условиях такой лицензии, в том случае, если дополнительный
      запрет не сохраняется при таком изменении условий лицензии или передаче.`,
      p40: `Если Вы добавляете условия для использования Лицензионного произведения в
      соответствии с настоящим разделом, Вы должны поместить в соответствующих файлах
      исходного текста уведомление о том, что к этим файлам применяются дополнительные
      условия, или указание на то, как ознакомиться с соответствующими условиями.
      Дополнительные разрешающие или ограничивающие условия могут быть сформулированы
      в виде отдельной лицензии или зафиксированы как исключения; вышеуказанные
      требования применяются в любом случае.`,
      h310: '8. Прекращение действия',
      p41_1: `Вы не можете распространять Лицензионное произведение или вносить в него
      изменения на условиях, отличающихся от явно оговоренных в настоящей Лицензии.
      Любая попытка распространения или внесения изменений на иных условиях является
      ничтожной и автоматически прекращает Ваши права, полученные по настоящей
      Лицензии (включая лицензию на любые патенты, предоставленные согласно третьему
      пункту раздела 11).`,
      p41_2: `Тем не менее если Вы прекращаете нарушение настоящей Лицензии, Ваши права,
      полученные от конкретного правообладателя, восстанавливаются (а) временно, до
      тех пор пока правообладатель явно и окончательно не прекратит действие Ваших
      прав, и (б) навсегда, если правообладатель не уведомит Вас о нарушении с помощью
      надлежащих средств в течение 60 дней после прекращения нарушений.`,
      p41_3: `Кроме того, Ваши права, полученные от конкретного правообладателя,
      восстанавливаются навсегда, если правообладатель впервые любым подходящим
      способом уведомляет Вас о нарушении настоящей Лицензии на свое произведение (для
      любого произведения) и Вы устраняете нарушение в течение 30 дней после получения
      уведомления.`,
      p41_4: `Прекращение Ваших прав, описанное в настоящем разделе, не прекращает действие
      лицензий лиц, которые получили от Вас копии произведения или права,
      предоставляемые настоящей Лицензией. Если Ваши права были прекращены навсегда и
      не восстановлены, Вы не можете вновь получить право на тот же материал на
      условиях, описанных в разделе 10.`,
      h311: '9. Акцепт не требуется для получения копий',
      p42: `Вы не обязаны принимать условия настоящей Лицензии для того, чтобы получить или
      запустить копию Программы. Случайное распространение Лицензионного произведения,
      происходящее вследствие использования одноранговой (пиринговой) сети для
      получения его копии, также не требует принятия этих условий. Тем не менее только
      настоящая Лицензия дает Вам право распространять или изменять любое Лицензионное
      произведение. Если Вы не приняли условия настоящей Лицензии, такие действия
      будут нарушением авторского права. Поэтому изменяя или распространяя
      Лицензионное произведение, Вы выражаете согласие с условиями настоящей Лицензии.`,
      h312: '10. Автоматическое получение прав последующими получателями',
      p43_1: `Каждый раз, когда Вы передаете Лицензионное произведение, получатель
      автоматически получает от его лицензиара право запускать, изменять и
      распространять это произведение при условии соблюдения настоящей Лицензии. Вы не
      несете ответственности за соблюдение третьими лицами условий настоящей Лицензии.
      "Реорганизацией" называются действия, в результате которых передается управление
      организацией или значительная часть ее активов, а также происходит разделение
      или слияние организаций. Если распространение Лицензионного произведения
      является результатом реорганизации, каждая из сторон сделки, получающая копию
      произведения, также получает все права на произведение, которые предшествующее
      юридическое лицо имело или могло предоставить согласно предыдущему абзацу, а
      также право на владение Полным исходным текстом произведения от предшественника,
      осуществляемое в его интересах, если предшественник владеет им или может
      получить его при разумных усилиях.`,
      p43_2: `Вы не можете налагать каких-либо дополнительных ограничений на осуществление
      прав, предоставленных или подтвержденных в соответствии с настоящей Лицензией.
      Например, Вы не можете ставить осуществление прав, предоставленных по настоящей
      Лицензии, в зависимость от оплаты отчислений, роялти или других сборов; также Вы
      не можете инициировать судебный процесс (включая встречный иск или заявление
      встречного требования в судебном процессе) о нарушении любых патентных прав при
      создании, использовании, продаже, предложении продажи, импорте Программы или
      любой ее части.`,
      h313: '11. Патенты',
      p44: `"Инвестором" называется правообладатель, разрешающий использование Программы
      либо произведения, на котором основана Программа, на условиях настоящей
      Лицензии. Произведение, лицензированное таким образом, называется "версией со
      вкладом" инвестора.`,
      p45: `"Неотъемлемые патентные претензии" инвестора -- все патентные права,
      принадлежащие инвестору или контролируемые им в настоящее время либо
      приобретенные в будущем, которые могут быть нарушены созданием, использованием
      или продажей версии со вкладом, допускаемыми настоящей Лицензией; они не
      включают в себя права, которые будут нарушены исключительно вследствие будущих
      изменений версии со вкладом. Для целей данного определения под "контролем"
      понимается право выдавать патентные сублицензии способами, не нарушающими
      требований настоящей Лицензии.`,
      p46: `Каждый инвестор предоставляет Вам неисключительную безвозмездную лицензию на
      патент, действующую во всем мире, соответствующую неотъемлемым патентным
      претензиям инвестора, на создание, использование, продажу, предложение для
      продажи, импорт, а также запуск, внесение изменений и распространение всего, что
      входит в состав версии со вкладом.`,
      p47: `В следующих трех абзацах "лицензией на патент" называется любое явно выраженное
      вовне согласие или обязательство не применять патент (например, выдача
      разрешения на использование запатентованного объекта или обещание не подавать в
      суд за нарушение патента). "Выдать" кому-то такую лицензию на патент означает
      заключить такое соглашение или обязаться не применять патент против него.`,
      p48: `Если Вы передаете Лицензионное произведение, сознательно основываясь на лицензии
      на патент, в то время как Полный исходный текст произведения невозможно
      бесплатно скопировать с общедоступного сервера или другим не вызывающим
      затруднений способом, Вы должны либо (1) обеспечить возможность такого доступа к
      Полному исходному тексту, либо (2) отказаться от прав, предоставленных по
      лицензии на патент для данного произведения, либо (3) принять меры по передаче
      лицензии на патент последующим получателям произведения, в соответствии с
      требованиями настоящей Лицензии. "Сознательно основываясь" означает, что Вы
      знаете, что при отсутствии лицензии на патент передача Вами Лицензионного
      произведения в определенной стране или использование получателем переданного ему
      Вами Лицензионного произведения в этой стране нарушит один или несколько
      определенных патентов этой страны, срок действия которых не истек.`,
      p49: `Если в соответствии или в связи с единичной сделкой либо соглашением Вы
      передаете или делаете заказ на распространение Лицензионного произведения, и
      предоставляете определенным лицам, получающим Лицензионное произведение,
      лицензию на патент, разрешающую им использовать, распространять, вносить
      изменения или передавать конкретные экземпляры Лицензионного произведения,
      права, которые Вы предоставляете по лицензии на патент, автоматически переходят
      ко всем получателям Лицензионного произведения и произведений, созданных на его
      основе.`,
      p50: `Патентная лицензия называется "дискриминирующей", если она не покрывает,
      запрещает осуществление или содержит в качестве условия отказ от применения
      одного или нескольких прав, предоставленных настоящей Лицензией. Вы не можете
      передавать Лицензионное произведение, если Вы являетесь участником договора с
      третьим лицом, осуществляющим распространение программного обеспечения, в
      соответствии с которым Вы делаете в пользу третьего лица выплаты, размер которых
      зависит от масштабов Вашей деятельности по передаче произведения, и в
      соответствии с которым любое третье лицо, получающее от Вас Лицензионное
      произведение, делает это на условиях дискриминирующей патентной лицензии (а)
      которая зависит от количества копий Лицензионного произведения, переданных Вами
      (или копий, сделанных с этих копий), или (b) которая используется
      преимущественно в конкретных товарах или подборках, содержащих Лицензионное
      произведение, или в связи с ними, в том случае, если Вы заключили данный договор
      или получили лицензию на патент после 28 марта 2007 года.`,
      p51: `Ничто в настоящей Лицензии не должно толковаться как исключение или ограничение
      любого предполагаемого права или других способов противодействия нарушениям,
      которые во всем остальном могут быть доступны для Вас в соответствии с
      применимым патентным правом.`,
      h314: '12. Запрет отказывать в свободе другим',
      p52: `Если на Вас наложены обязанности (будь то по решению суда, договору или иным
      способом), которые противоречат условиям настоящей Лицензии, это не освобождает
      Вас от соблюдения ее условий. Если Вы не можете передать Лицензионное
      произведение так, чтобы одновременно выполнять Ваши обязательства по настоящей
      Лицензии и любые другие относящиеся к делу обязательства, то Вы не можете
      передавать его вообще. Например, если Вы согласны с условием, обязывающими Вас
      производить сбор отчислений за дальнейшую передачу от тех, кому Вы передаете
      Программу, то для того, чтобы соблюсти это условие и выполнить требования
      настоящей Лицензии, Вы должны полностью воздержаться от передачи Программы.`,
      h315: '13. Удаленное сетевое взаимодействие; Применение совместно с Генеральной публичной лицензией GNU',
      p53: `Независимо от любых других положений настоящей Лицензии, при изменении программы
      Ваша модифицированная версия должна в явной форме предложить всем пользователям,
      взаимодействующим с ней удаленно через компьютерную сеть (если Ваша версия
      поддерживает такое взаимодействие), возможность получить Полный исходный текст
      Вашей версии путем предоставляя доступа к нему с сетевого сервера без взимания
      платы, посредством стандартных или традиционных способов, используемых для
      копирования программного обеспечения. Этот Полный исходный текст должен включать
      в себя Полный исходный текст для любого произведения, распространяемого на
      условиях редакции 3 Генеральной публичной лицензии GNU, условия которой
      применяются в соответствии со следующим абзацем.`,
      p54: `Независимо от любых других положений настоящей Лицензии, Вам разрешается
      связывать или соединять любое Лицензионное произведение в единое составное
      произведение с произведением, лицензированным на условиях редакции 3 Генеральной
      публичной лицензии GNU, а также передавать получившееся произведение. Условия
      настоящей Лицензии продолжают применяться к той его части, которая является
      Лицензионным произведением, но использование того произведения, с которым оно
      объединено, будет по-прежнему регулироваться редакцией 3 Генеральной публичной
      лицензии GNU.`,
      h316: '14. Пересмотренные редакции настоящей Лицензии',
      p55_1: `Фонд свободного программного обеспечения время от времени может публиковать
      пересмотренные и (или) новые редакции Генеральной публичной лицензии GNU Affero.
      Они будут аналогичны по смыслу настоящей редакции, но могут отличаться от нее в
      деталях, направленных на решение новых проблем или регулирование новых
      отношений.`,
      p55_2: `Каждой редакции присваивается собственный номер. Если для Программы указано, что
      к ней применима определенная редакция Генеральной публичной лицензии GNU Affero
      "или любая более поздняя редакция", у Вас есть возможность использовать термины
      и условия, содержащиеся в редакции с указанным номером или любой более поздней
      редакции, опубликованной Фондом свободного программного обеспечения. Если для
      Программы не указан номер редакции Генеральной публичной лицензии GNU Affero, Вы
      можете выбрать любую редакцию, опубликованную Фондом свободного программного
      обеспечения.`,
      p56: `Если Вы получили Программу, содержащую указание на то, что доверенное лицо
      правообладателя может выбирать, какую из будущих версий Генеральной публичной
      лицензии GNU Affero использовать, то публичное заявление этого лица о принятии
      любой версии позволяет Вам выбрать эту версию для применения ее условий к
      Программе.`,
      p57: `Более поздние редакции Лицензии могут дать Вам дополнительные или принципиально
      иные права. Тем не менее в результате Вашего выбора более поздней редакции на
      автора или правообладателя не возлагается никаких дополнительных обязанностей.`,
      h317: '15. Отказ от гарантий',
      p58: `НА ПРОГРАММУ НЕ ПРЕДОСТАВЛЯЕТСЯ НИКАКИХ ГАРАНТИЙ ЗА ИСКЛЮЧЕНИЕМ ПРЕДУСМОТРЕННЫХ
      ДЕЙСТВУЮЩИМ ЗАКОНОДАТЕЛЬСТВОМ. ЕСЛИ ИНОЕ НЕ УКАЗАНО В ПИСЬМЕННОЙ ФОРМЕ,
      ПРАВООБЛАДАТЕЛИ И (ИЛИ) ТРЕТЬИ ЛИЦА ПРЕДОСТАВЛЯЮТ ПРОГРАММУ "КАК ЕСТЬ", БЕЗ
      КАКИХ-ЛИБО ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ ГАРАНТИЙ, ВКЛЮЧАЯ ГАРАНТИИ ПРИГОДНОСТИ ДЛЯ
      КОНКРЕТНЫХ ЦЕЛЕЙ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ. ВЕСЬ РИСК, СВЯЗАННЫЙ С КАЧЕСТВОМ И
      ПРОИЗВОДИТЕЛЬНОСТЬЮ ПРОГРАММЫ, ВОЗЛАГАЕТСЯ НА ВАС. ЕСЛИ В ПРОГРАММЕ БУДУТ
      ВЫЯВЛЕНЫ НЕДОСТАТКИ, ВЫ ПРИНИМАЕТЕ НА СЕБЯ СТОИМОСТЬ ВСЕГО НЕОБХОДИМОГО
      ОБСЛУЖИВАНИЯ, РЕМОНТА ИЛИ ИСПРАВЛЕНИЯ.`,
      h318: '16. Ограничение ответственности',
      p59: `ЕСЛИ ИНОЕ НЕ ПРЕДУСМОТРЕНО ДЕЙСТВУЮЩИМ ЗАКОНОДАТЕЛЬСТВОМ ИЛИ СОГЛАШЕНИЕМ СТОРОН,
      ЗАКЛЮЧЕННЫМ В ПИСЬМЕННОЙ ФОРМЕ, ПРАВООБЛАДАТЕЛЬ ИЛИ ИНОЕ ЛИЦО, КОТОРОЕ ВНОСИТ
      ИЗМЕНЕНИЯ В ПРОГРАММУ И (ИЛИ) ПЕРЕДАЕТ ЕЕ НА УСЛОВИЯХ, СФОРМУЛИРОВАННЫХ ВЫШЕ, НЕ
      МОЖЕТ НЕСТИ ОТВЕТСТВЕННОСТЬ ПЕРЕД ВАМИ ЗА ПРИЧИНЕННЫЙ УЩЕРБ, ВКЛЮЧАЯ УЩЕРБ
      ОБЩЕГО ЛИБО КОНКРЕТНОГО ХАРАКТЕРА, ПРИЧИНЕННЫЙ СЛУЧАЙНО ИЛИ ЯВЛЯЮЩИЙСЯ
      СЛЕДСТВИЕМ ИСПОЛЬЗОВАНИЯ ПРОГРАММЫ ЛИБО НЕВОЗМОЖНОСТИ ЕЕ ИСПОЛЬЗОВАНИЯ (В ТОМ
      ЧИСЛЕ ЗА УНИЧТОЖЕНИЕ ИЛИ МОДИФИКАЦИЮ ИНФОРМАЦИИ, ЛИБО УБЫТКИ, ПОНЕСЕННЫЕ ВАМИ
      ИЛИ ТРЕТЬИМИ ЛИЦАМИ, ЛИБО СБОИ ПРОГРАММЫ ПРИ ВЗАИМОДЕЙСТВИИ С ДРУГИМ ПРОГРАММНЫМ
      ОБЕСПЕЧЕНИЕМ), В ТОМ ЧИСЛЕ И В СЛУЧАЯХ, КОГДА ПРАВООБЛАДАТЕЛЬ ИЛИ ТРЕТЬЕ ЛИЦО
      ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ ПРИЧИНЕНИЯ ТАКИХ УБЫТКОВ.`,
      h319: '17. Толкование разделов 15 и 16',
      p60: `Если отказ от гарантии и ограничение ответственности, представленные выше, по
      закону не могут быть применены в соответствии с их условиями, суды,
      рассматривающие спор, должны применить действующий закон, который в наибольшей
      степени предусматривает абсолютный отказ от всей гражданской ответственности в
      связи с Программой, за исключением случаев, когда гарантия или принятие на себя
      ответственности за копию программы предоставляется за плату.`,
      h2_4: 'КОНЕЦ ОПРЕДЕЛЕНИЙ И УСЛОВИЙ',
      h320: 'Порядок применения условий Лицензии к Вашим программам',
      p61: `Если Вы разрабатываете новую программу и хотите, чтобы ее использование принесло
      максимальную пользу обществу, наилучший способ достичь этого -- сделать ее
      свободной, чтобы все могли распространять и изменять ее на условиях настоящей
      Лицензии.`,
      p62: `Для этого сделайте так, чтобы программа содержала в себе описанные ниже
      уведомления. Самым надежным способом это сделать является включение их в начало
      каждого файла исходного текста, чтобы наиболее эффективным образом сообщить об
      отсутствии гарантий; каждый файл должен иметь по меньшей мере одну строку с
      оповещением об авторских правах и указанием на то, где находится полный текст
      уведомлений.`,
      p63: `<Строка с названием Программы и информацией о ее назначении.> Copyright © <год
      выпуска программы в свет> <имя автора>
      Эта программа является свободным программным обеспечением: Вы можете
      распространять ее и (или) изменять, соблюдая условия Генеральной публичной
      лицензии GNU Affero, опубликованной Фондом свободного программного обеспечения;
      либо редакции 3 Лицензии, либо (на Ваше усмотрение) любой редакции, выпущенной
      позже.`,
      p64: `Эта программа распространяется в расчете на то, что она окажется полезной, но
      БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, включая подразумеваемую гарантию КАЧЕСТВА либо
      ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННЫХ ЦЕЛЕЙ.
      Ознакомьтесь с Генеральной публичной лицензией GNU Affero для получения более
      подробной информации.`,
      p65: `Вы должны были получить копию Генеральной публичной лицензии GNU Affero вместе с
      этой программой. Если Вы ее не получили, то перейдите по адресу:
      http://www.gnu.org/licenses/.`,
      p66_1: `Также добавьте информацию о том, как связаться с Вами посредством электронной
      или обычной почты.`,
      p66_2: `Если Ваша программа может взаимодействовать с пользователями удаленно через
      компьютерную сеть, Вы также должны убедиться, что обеспечили ее пользователям
      возможность получить ее исходные тексты. Например, если Ваша программа является
      веб-приложением, ее интерфейс может отображать ссылку "Источник", которая
      указывает на архив с текстом. Существует много способов, которыми Вы можете
      распространять исходные тексты, для разных программ подходят разные решения;
      ознакомьтесь с разделом 13 для того, чтобы узнать конкретные требования.`,
      p67: `Вы также должны получить от своего работодателя (если Вы работаете
      программистом) или, при необходимости, учебного заведения, письменный отказ от
      исключительных прав на Программу, если это необходимо. Для получения
      дополнительной информации об этом, а также о применении и соблюдении условий GNU
      AGPL, см http://www.gnu.org/licenses/.`,
    },
  },
};

export default ruLocales;
